
## Plan Result




<pre><code>Plan: 138 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_automation_account.pre-aa
  * azurerm_data_protection_backup_instance_blob_storage.finalsabackup
  * azurerm_data_protection_backup_instance_blob_storage.ingestsabackup
  * azurerm_data_protection_backup_instance_blob_storage.sabackup
  * azurerm_data_protection_backup_policy_blob_storage.pre_backup_policy_storage
  * azurerm_data_protection_backup_vault.pre_backup_vault
  * azurerm_dev_test_global_vm_shutdown_schedule.dg_vm[0]
  * azurerm_dev_test_global_vm_shutdown_schedule.dg_vm[1]
  * azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[0]
  * azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[1]
  * azurerm_key_vault_secret.POSTGRES_PASS
  * azurerm_key_vault_secret.POSTGRES_USER
  * azurerm_key_vault_secret.dg_password[0]
  * azurerm_key_vault_secret.dg_password[1]
  * azurerm_key_vault_secret.dg_username[0]
  * azurerm_key_vault_secret.dg_username[1]
  * azurerm_key_vault_secret.edit_password[0]
  * azurerm_key_vault_secret.edit_username[0]
  * azurerm_key_vault_secret.finalsa_storage_account_connection_string
  * azurerm_key_vault_secret.ingestsa_storage_account_connection_string
  * azurerm_key_vault_secret.powerbi_dg_password[0]
  * azurerm_key_vault_secret.powerbi_dg_password[1]
  * azurerm_key_vault_secret.powerbi_dg_recovery[0]
  * azurerm_key_vault_secret.powerbi_dg_recovery[1]
  * azurerm_key_vault_secret.powerbi_dg_username[0]
  * azurerm_key_vault_secret.powerbi_dg_username[1]
  * azurerm_key_vault_secret.sa_storage_account_connection_string
  * azurerm_management_lock.storage-backup-final
  * azurerm_management_lock.storage-backup-ingest
  * azurerm_management_lock.storage-backup-sa
  * azurerm_media_content_key_policy.ams_default_policy
  * azurerm_media_services_account.ams
  * azurerm_media_transform.EncodeToMP
  * azurerm_media_transform.analysevideo
  * azurerm_monitor_diagnostic_setting.ams_1
  * azurerm_monitor_diagnostic_setting.storageblobfinalsa
  * azurerm_monitor_diagnostic_setting.storageblobingestsa
  * azurerm_monitor_diagnostic_setting.storageblobsa
  * azurerm_private_dns_zone_virtual_network_link.ams_zone_link
  * azurerm_private_dns_zone_virtual_network_link.postgres_dg
  * azurerm_private_endpoint.ams_streamingendpoint_private_endpoint
  * azurerm_resource_group.rg_backup
  * azurerm_role_assignment.backup_role_finalsa
  * azurerm_role_assignment.backup_role_ingestsa
  * azurerm_role_assignment.backup_role_sa
  * azurerm_role_assignment.powerapp_appreg_final
  * azurerm_role_assignment.powerapp_appreg_final_contrib
  * azurerm_role_assignment.powerapp_appreg_finalbackup
  * azurerm_role_assignment.powerapp_appreg_ingest
  * azurerm_role_assignment.powerapp_appreg_ingest_contrib
  * azurerm_role_assignment.powerapp_appreg_ingestfinal
  * azurerm_role_assignment.powerapp_appreg_sa
  * azurerm_role_assignment.powerapp_appreg_sa2
  * azurerm_role_assignment.powerapp_appreg_sa_cont
  * azurerm_role_assignment.powerapp_appreg_sabackup
  * azurerm_role_assignment.vmuser_login[0]
  * azurerm_virtual_machine_extension.aad[0]
  * azurerm_virtual_machine_extension.edit_init[0]
  * azurerm_virtual_machine_extension.powerbi_gateway_init[0]
  * azurerm_virtual_machine_extension.powerbi_gateway_init[1]
  * random_password.dg_password[0]
  * random_password.dg_password[1]
  * random_password.powerbi_dg_password[0]
  * random_password.powerbi_dg_password[1]
  * random_password.vm_password[0]
  * random_string.dg_username[0]
  * random_string.dg_username[1]
  * random_string.powerbi_dg_username[0]
  * random_string.powerbi_dg_username[1]
  * random_string.vm_username[0]
  * module.ams_function_app.azurerm_application_insights.appinsight
  * module.ams_function_app.azurerm_linux_function_app.this[0]
  * module.ams_function_app.azurerm_service_plan.this[0]
  * module.ams_function_app.azurerm_storage_account.this
  * module.data_gateway_vm[0].azurerm_key_vault_key.disk_enc_key[0]
  * module.data_gateway_vm[0].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.data_gateway_vm[0].azurerm_network_interface.vm_nic
  * module.data_gateway_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.data_gateway_vm[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0]
  * module.data_gateway_vm[0].random_string.password
  * module.data_gateway_vm[1].azurerm_key_vault_key.disk_enc_key[0]
  * module.data_gateway_vm[1].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.data_gateway_vm[1].azurerm_network_interface.vm_nic
  * module.data_gateway_vm[1].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.data_gateway_vm[1].azurerm_virtual_machine_extension.vmextension[0]
  * module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0]
  * module.data_gateway_vm[1].random_string.password
  * module.data_store_db_v14.azurerm_postgresql_flexible_server.pgsql_server
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_database.pg_databases[&#34;pre-pdb-stg&#34;]
  * module.data_store_db_v14.null_resource.set-user-permissions-additionaldbs[&#34;pre-pdb-stg&#34;]
  * module.data_store_db_v14.random_password.password
  * module.edit_vm[0].azurerm_key_vault_key.disk_enc_key[0]
  * module.edit_vm[0].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.edit_vm[0].azurerm_network_interface.vm_nic
  * module.edit_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.edit_vm[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.edit_vm[0].azurerm_windows_virtual_machine.winvm[0]
  * module.edit_vm[0].random_string.password
  * module.finalsa_storage_account.azurerm_private_endpoint.this[0]
  * module.finalsa_storage_account.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Contributor&#34;]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.finalsa_storage_account.random_string.storage_account_random_string
  * module.finalsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.finalsa_storage_account_backup.random_string.storage_account_random_string
  * module.ingestsa_storage_account.azurerm_private_endpoint.this[0]
  * module.ingestsa_storage_account.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Contributor&#34;]
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.random_string.storage_account_random_string
  * module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account_backup.random_string.storage_account_random_string
  * module.powerBI_data_gateway[0].azurerm_key_vault_key.disk_enc_key[0]
  * module.powerBI_data_gateway[0].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[0].azurerm_network_interface.vm_nic
  * module.powerBI_data_gateway[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.powerBI_data_gateway[0].azurerm_windows_virtual_machine.winvm[0]
  * module.powerBI_data_gateway[0].random_string.password
  * module.powerBI_data_gateway[1].azurerm_key_vault_key.disk_enc_key[0]
  * module.powerBI_data_gateway[1].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[1].azurerm_network_interface.vm_nic
  * module.powerBI_data_gateway[1].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[1].azurerm_virtual_machine_extension.vmextension[0]
  * module.powerBI_data_gateway[1].azurerm_windows_virtual_machine.winvm[0]
  * module.powerBI_data_gateway[1].random_string.password
  * module.sa_storage_account.azurerm_private_endpoint.this[0]
  * module.sa_storage_account.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Contributor&#34;]
  * module.sa_storage_account.azurerm_storage_account.storage_account
  * module.sa_storage_account.random_string.storage_account_random_string
  * module.sa_storage_account_backup.azurerm_storage_account.storage_account
  * module.sa_storage_account_backup.random_string.storage_account_random_string
  * module.timestamp_function_app.azurerm_application_insights.appinsight
  * module.timestamp_function_app.azurerm_service_plan.this[0]
  * module.timestamp_function_app.azurerm_storage_account.this
  * module.timestamp_function_app.azurerm_windows_function_app.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_automation_account.pre-aa will be created
  + resource "azurerm_automation_account" "pre-aa" {
      + dsc_primary_access_key        = (sensitive value)
      + dsc_secondary_access_key      = (sensitive value)
      + dsc_server_endpoint           = (known after apply)
      + hybrid_service_url            = (known after apply)
      + id                            = (known after apply)
      + local_authentication_enabled  = true
      + location                      = "uksouth"
      + name                          = "pre-stg-aa"
      + private_endpoint_connection   = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "pre-stg"
      + sku_name                      = "Basic"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_data_protection_backup_instance_blob_storage.finalsabackup will be created
  + resource "azurerm_data_protection_backup_instance_blob_storage" "finalsabackup" {
      + backup_policy_id   = (known after apply)
      + id                 = (known after apply)
      + location           = "uksouth"
      + name               = "pre-finalsa-backup-stg"
      + storage_account_id = (known after apply)
      + vault_id           = (known after apply)
    }

  # azurerm_data_protection_backup_instance_blob_storage.ingestsabackup will be created
  + resource "azurerm_data_protection_backup_instance_blob_storage" "ingestsabackup" {
      + backup_policy_id   = (known after apply)
      + id                 = (known after apply)
      + location           = "uksouth"
      + name               = "pre-ingestsa-backup-stg"
      + storage_account_id = (known after apply)
      + vault_id           = (known after apply)
    }

  # azurerm_data_protection_backup_instance_blob_storage.sabackup will be created
  + resource "azurerm_data_protection_backup_instance_blob_storage" "sabackup" {
      + backup_policy_id   = (known after apply)
      + id                 = (known after apply)
      + location           = "uksouth"
      + name               = "pre-sa-backup-stg"
      + storage_account_id = (known after apply)
      + vault_id           = (known after apply)
    }

  # azurerm_data_protection_backup_policy_blob_storage.pre_backup_policy_storage will be created
  + resource "azurerm_data_protection_backup_policy_blob_storage" "pre_backup_policy_storage" {
      + id                 = (known after apply)
      + name               = "pre-backup-policy-stg"
      + retention_duration = "P1D"
      + vault_id           = (known after apply)
    }

  # azurerm_data_protection_backup_vault.pre_backup_vault will be created
  + resource "azurerm_data_protection_backup_vault" "pre_backup_vault" {
      + datastore_type      = "VaultStore"
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "pre-backup-vault-stg"
      + redundancy          = "LocallyRedundant"
      + resource_group_name = "pre-stg"
      + tags                = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.dg_vm[0] will be created
  + resource "azurerm_dev_test_global_vm_shutdown_schedule" "dg_vm" {
      + daily_recurrence_time = "1800"
      + enabled               = false
      + id                    = (known after apply)
      + location              = "uksouth"
      + tags                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + timezone              = "GMT Standard Time"
      + virtual_machine_id    = (known after apply)

      + notification_settings {
          + enabled         = false
          + time_in_minutes = 30
        }
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.dg_vm[1] will be created
  + resource "azurerm_dev_test_global_vm_shutdown_schedule" "dg_vm" {
      + daily_recurrence_time = "1800"
      + enabled               = false
      + id                    = (known after apply)
      + location              = "uksouth"
      + tags                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + timezone              = "GMT Standard Time"
      + virtual_machine_id    = (known after apply)

      + notification_settings {
          + enabled         = false
          + time_in_minutes = 30
        }
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[0] will be created
  + resource "azurerm_dev_test_global_vm_shutdown_schedule" "powerbi_dg_vm" {
      + daily_recurrence_time = "1800"
      + enabled               = false
      + id                    = (known after apply)
      + location              = "uksouth"
      + tags                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + timezone              = "GMT Standard Time"
      + virtual_machine_id    = (known after apply)

      + notification_settings {
          + enabled         = false
          + time_in_minutes = 30
        }
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[1] will be created
  + resource "azurerm_dev_test_global_vm_shutdown_schedule" "powerbi_dg_vm" {
      + daily_recurrence_time = "1800"
      + enabled               = false
      + id                    = (known after apply)
      + location              = "uksouth"
      + tags                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + timezone              = "GMT Standard Time"
      + virtual_machine_id    = (known after apply)

      + notification_settings {
          + enabled         = false
          + time_in_minutes = 30
        }
    }

  # azurerm_key_vault_secret.POSTGRES_PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "postgresdb-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "postgresdb-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.dg_password[0] will be created
  + resource "azurerm_key_vault_secret" "dg_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "dg1-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.dg_password[1] will be created
  + resource "azurerm_key_vault_secret" "dg_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "dg2-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.dg_username[0] will be created
  + resource "azurerm_key_vault_secret" "dg_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "dg1-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.dg_username[1] will be created
  + resource "azurerm_key_vault_secret" "dg_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "dg2-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.edit_password[0] will be created
  + resource "azurerm_key_vault_secret" "edit_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "videditvm0-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.edit_username[0] will be created
  + resource "azurerm_key_vault_secret" "edit_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "videditvm0-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.finalsa_storage_account_connection_string will be created
  + resource "azurerm_key_vault_secret" "finalsa_storage_account_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "finalsa-storage-account-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.ingestsa_storage_account_connection_string will be created
  + resource "azurerm_key_vault_secret" "ingestsa_storage_account_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "ingestsa-storage-account-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.powerbi_dg_password[0] will be created
  + resource "azurerm_key_vault_secret" "powerbi_dg_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "powerbi-dg1-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.powerbi_dg_password[1] will be created
  + resource "azurerm_key_vault_secret" "powerbi_dg_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "powerbi-dg2-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.powerbi_dg_recovery[0] will be created
  + resource "azurerm_key_vault_secret" "powerbi_dg_recovery" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "powerbi-dg1-recovery-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.powerbi_dg_recovery[1] will be created
  + resource "azurerm_key_vault_secret" "powerbi_dg_recovery" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "powerbi-dg2-recovery-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.powerbi_dg_username[0] will be created
  + resource "azurerm_key_vault_secret" "powerbi_dg_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "powerbi-dg1-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.powerbi_dg_username[1] will be created
  + resource "azurerm_key_vault_secret" "powerbi_dg_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "powerbi-dg2-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sa_storage_account_connection_string will be created
  + resource "azurerm_key_vault_secret" "sa_storage_account_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "sa-storage-account-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_management_lock.storage-backup-final will be created
  + resource "azurerm_management_lock" "storage-backup-final" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "storage-backup"
      + notes      = "prevent users

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

   = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }

          + restore_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
            ]
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.sa_storage_account_backup.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.timestamp_function_app.azurerm_application_insights.appinsight will be created
  + resource "azurerm_application_insights" "appinsight" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "pre-pre-timestamp-mgmt-stg"
      + resource_group_name                   = "pre-stg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
    }

  # module.timestamp_function_app.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "pre-asp-pre-timestamp-mgmt"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "pre-stg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + worker_count                 = (known after apply)
    }

  # module.timestamp_function_app.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "pretimestampmgmtstg"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "pre-stg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }

          + restore_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.timestamp_function_app.azurerm_windows_function_app.this[0] will be created
  + resource "azurerm_windows_function_app" "this" {
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + hosting_environment_id            = (known after apply)
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = "pre-timestamp-mgmt-stg"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "pre-stg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (sensitive value)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "pretimestampmgmtstg"
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                              = (known after apply)
          + app_scale_limit                        = (known after apply)
          + application_insights_connection_string = (sensitive value)
          + default_documents                      = (known after apply)
          + detailed_error_logging_enabled         = (known after apply)
          + elastic_instance_minimum               = (known after apply)
          + ftps_state                             = "Disabled"
          + health_check_eviction_time_in_min      = (known after apply)
          + http2_enabled                          = false
          + load_balancing_mode                    = "LeastRequests"
          + managed_pipeline_mode                  = "Integrated"
          + minimum_tls_version                    = "1.2"
          + pre_warmed_instance_count              = (known after apply)
          + remote_debugging_enabled               = false
          + remote_debugging_version               = (known after apply)
          + scm_minimum_tls_version                = "1.2"
          + scm_type                               = (known after apply)
          + scm_use_main_ip_restriction            = false
          + use_32_bit_worker                      = true
          + vnet_route_all_enabled                 = false
          + websockets_enabled                     = false
          + windows_fx_version                     = (known after apply)
          + worker_count                           = (known after apply)

          + application_stack {
              + dotnet_version              = (known after apply)
              + java_version                = (known after apply)
              + node_version                = (known after apply)
              + powershell_core_version     = (known after apply)
              + use_custom_runtime          = (known after apply)
              + use_dotnet_isolated_runtime = (known after apply)
            }
        }
    }

Plan: 138 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":567,"Program":"tfcmt","SHA1":"","Vars":{}} -->